docs/early-init.org
#+title: Early Init
#+OPTIONS: toc:t
#+PROPERTY: header-args:emacs-lisp :tangle ./../early-init.el :mkdirp yes

* Gc threshold
We increase the gc threshold for a faster startup, the default is 800 kB.

#+begin_src emacs-lisp

  (setq gc-cons-threshold (* 50 1000 1000))

#+end_src


* Loading compiled .el files

We prefer loading newest compiled .el file

#+begin_src emacs-lisp

(customize-set-variable 'load-prefer-newer noninteractive)

#+end_src

* Package set-up

#+begin_src emacs-lisp

	(require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))

  (setq package-check-signature nil) 
  ;; probably not necessary


  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+end_src


* Native Compilation settings

When native compilation is available, we want it to happen asynchronously and silently.
We'll also have to change the directoy where the compilation cache is stored (although this
depends more on the emacs version)

#+begin_src emacs-lisp

  (when (featurep 'native-compile)
  (setq comp-speed 2)
	(setq native-comp-async-report-warnings-errors nil)
	(setq native-comp-deferred-compilation t)
	(when (fboundp 'startup-redirect-eln-cache)
	  (if (version< emacs-version "29")
		  (add-to-list 'native-comp-eln-load-path (convert-standard-filename (expand-file-name "var/eln-cache/" user-emacs-directory)))
		(startup-redirect-eln-cache (convert-standard-filename (expand-file-name "var/eln-cache/" user-emacs-directory)))))

	(add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory)))


#+end_src


* Early UI config

#+begin_src emacs-lisp

	;; Remove some unneeded UI elements (the user can turn back on anything they wish)
	(setq inhibit-startup-message t)
	(push '(tool-bar-lines . 0) default-frame-alist)
	(push '(menu-bar-lines . 0) default-frame-alist)
	(push '(vertical-scroll-bars) default-frame-alist)
	(push '(mouse-color . "white") default-frame-alist)

  (customize-set-variable 'initial-major-mode 'fundamental-mode)

#+end_src
